uploads/xml/Travelport-Request-6656e4d75b016-1006.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="d914cc11cca16e676fe0a176d36b35ed">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="DMM"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="JED"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-05-30"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="First"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="JED"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="DMM"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-05-31"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="First"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
